; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared3 - mode
	infrared4 - mode
	thermograph1 - mode
	image0 - mode
	spectrograph2 - mode
	spectrograph5 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	Star11 - direction
	Star12 - direction
	Star9 - direction
	GroundStation13 - direction
	Star4 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph5)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation13)
	(supports instrument1 infrared4)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation13)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(have_image Phenomenon14 image0)
	(have_image Phenomenon14 thermograph1)
	(have_image Phenomenon15 infrared3)
	(have_image Phenomenon15 spectrograph2)
	(have_image Star16 spectrograph5)
	(have_image Planet17 infrared3)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 phenomenon14 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon14 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 6
5. (turn_to satellite1 star4 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
6. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 6
7. (turn_to satellite1 phenomenon14 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 6
8. (take_image satellite1 phenomenon14 instrument1 image0)
   added: (have_image phenomenon14 image0)
   goals met: 1 of 6
9. (turn_to satellite0 star9 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star9)
   goals met: 1 of 6
10. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 1 of 6
11. (turn_to satellite0 phenomenon14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 6
12. (take_image satellite0 phenomenon14 instrument0 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 2 of 6
13. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 6
14. (take_image satellite0 phenomenon15 instrument0 infrared3)
   added: (have_image phenomenon15 infrared3)
   goals met: 3 of 6
15. (take_image satellite0 phenomenon15 instrument0 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 4 of 6
16. (turn_to satellite0 planet17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet17)
   goals met: 4 of 6
17. (take_image satellite0 planet17 instrument0 infrared3)
   added: (have_image planet17 infrared3)
   goals met: 5 of 6
18. (turn_to satellite0 star16 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star16)
   goals met: 5 of 6
19. (take_image satellite0 star16 instrument0 spectrograph5)
   added: (have_image star16 spectrograph5)
   goals met: 6 of 6
